# Core CLI
brew "git"
brew "tmux"
brew "bat"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "jq"
brew "yq"
brew "eza"
brew "zoxide"
brew "gh"
brew "tldr"

# Shell and editor
brew "neovim"

# Language runtimes
brew "node"
brew "python@3.13"

# Terminal
cask "ghostty"
cask "font-maple-mono-nf-cn"
